---
title: "#2002 Cannot log in to the MySQL server"
date: 2012-03-19
forum: General Help
---

### Post by JimTheSailor on 2012-03-19
The story:
A couple days ago I had created a new database and added a table to it using phpMyAdmin running on the Chrome browser. I then attempted to do something else, don't remember what, using the same software, when Chrome crashed.
I then could not get into the database using my name. (I had done everything else using my name.) I could however get in using root.
I could also log into MySQL using "mysql -h localhost -u root -p" 

I decided to stop and restart MySQL using "sudo stop mysql" and "sudo start mysql".
Since then I have not been able to get into MySQL at all.

Using phpMyAdmin I get "#2002 Cannot log in to the MySQL server"
Using "mysql -h localhost -u root -p" I get "ERROR 2002 (HY000): Can't connect to local MySQL server through socket '/var/run/mysqld/mysqld.sock' (2)"
Using "sudo ls -l /var/run/" I see a list of directories and files including
drwxr-xr-x 2 mysql      root         40 2012-03-19 12:58 mysqld"
But if I use "sudo ls -l /var/run/mysqld" I see no files at all.
Thanks for any help you can give me.
Jim

---

### Post by Habitual on 2012-03-19
is mysqld running?

Terminal >
```
ps -e | grep mysql
```

---

### Post by JimTheSailor on 2012-03-19
"ps -e | grep mysql" displays nothing.

However, " sudo /etc/init.d/mysql restart" gives the following:
Rather than invoking init scripts through /etc/init.d, use the service(8)
utility, e.g. service mysql restart

Since the script you are attempting to invoke has been converted to an
Upstart job, you may also use the restart(8) utility, e.g. restart mysql
start: Job is already running: mysq

---

### Post by iiz on 2012-03-20
Try
```
sudo service mysqld start
```

or
```
sudo mysqld &
```

Better to use method #1

---

### Post by Todalozyzok on 2012-03-20
脢卯矛茂脿铆猫每 脙猫盲冒卯-脙脌脨脌脥脪 莽脿铆猫矛脿氓貌帽每 茂冒卯猫莽芒卯盲帽貌芒卯矛 冒氓莽猫铆卯-貌氓玫铆猫梅氓帽锚猫玫 猫莽盲氓毛猫茅. 脗 帽茂氓锚貌冒 猫玫 茂冒卯盲贸锚枚猫猫 芒玫卯盲每貌: 茫猫盲冒卯酶茂卯铆锚猫, [ 茫氓冒铆猫貌卯芒没茅 酶铆贸冒](http://www.gernit.ru)   , 盲氓么卯冒矛脿枚猫卯铆铆没氓  酶芒没, [谩氓铆貌卯铆猫貌卯芒没茅 酶铆贸冒](http://www.gidroshponka.ru/2011-02-06-21-02-13.html)  , 酶铆贸冒没 猫莽 茫猫盲冒卯么猫毛眉铆卯茅 冒氓莽猫铆没, [ 谩氓铆貌卯铆猫貌卯芒没氓 矛脿貌没](http://xn----8sbbeobt9aeakc2cdg3lf.xn--p1ai)    , [茂冒卯么猫毛猫冒卯芒脿铆铆没氓 矛氓矛谩冒脿铆没](http://www.membrana.su)   . 脻貌卯 毛猫酶眉 铆氓谩卯毛眉酶卯茅 茂氓冒氓梅氓铆眉 猫玫 茂冒卯盲贸锚枚猫猫. 脙猫盲冒卯酶茂卯铆锚猫 脙猫盲冒卯脢卯铆貌贸冒 帽氓茫卯盲铆每 每芒毛每镁貌帽每 毛猫盲氓冒卯矛 茂卯 枚氓铆氓 猫 锚脿梅氓帽貌芒贸 猫 茂卯毛眉莽贸镁貌帽每 卯茫冒卯矛铆没矛 帽茂冒卯帽卯矛 帽冒氓盲猫 帽貌冒卯猫貌氓毛眉铆没玫 卯冒茫脿铆猫莽脿枚猫茅. 脙氓冒铆猫貌卯芒没氓 酶铆贸冒没 芒没帽卯锚卯茫卯 锚脿梅氓帽貌芒脿 冒脿莽毛猫梅铆没玫 茂毛卯貌铆卯帽貌氓茅 酶猫冒卯锚卯 猫帽茂卯毛眉莽贸氓貌帽每 盲毛每 茫氓冒矛氓貌猫莽脿枚猫猫 矛氓忙茂脿铆氓毛眉铆没玫 酶芒卯芒 猫 盲氓么卯冒矛脿枚猫卯铆铆没玫 酶芒卯芒 莽盲脿铆猫每. [脕氓铆貌卯铆猫貌卯芒没氓 矛脿貌没 脨卯帽谩氓铆貌](http://www.rosbent.ru)    每芒毛每镁貌帽每 脿铆脿毛卯茫卯矛 矛脿貌卯芒 [ Voltex](http://xn----8sbbeobt9aeakc2cdg3lf.xn--p1ai)  , 矛铆卯茫卯 毛氓貌 茂冒猫矛氓铆每镁貌帽每 铆脿 冒没铆锚氓 冒脭, 猫帽茂卯毛眉莽卯芒脿毛猫帽眉 铆脿 帽卯貌铆每玫 莽铆脿梅猫矛没玫 卯谩煤氓貌卯芒 脨卯帽帽猫猫. 脪脿锚忙氓 锚卯矛茂脿铆猫每 脙猫盲冒卯-脙脌脨脌脥脪 芒没茂卯毛铆每氓貌 莽脿锚脿莽没 冒氓莽猫铆卯芒没玫 猫莽盲氓毛猫茅 猫 猫莽盲氓毛猫茅 猫莽 脧脗脮 茂卯 梅氓冒貌氓忙脿矛 莽脿锚脿莽梅猫锚脿. 脰氓铆没 芒帽氓茫盲脿 铆猫莽锚猫氓, 谩氓莽 铆脿锚冒贸貌卯锚 茂氓冒氓茂冒卯盲脿芒枚卯芒

---

### Post by JimTheSailor on 2012-03-20
"sudo service mysqld start" gives me "unrecognized service"

---

### Post by JimTheSailor on 2012-03-20
"sudo service mysqld start" gives me "unrecognized service"

"sudo mysqld &" gives me "[1] 5360"

---

### Post by JimTheSailor on 2012-03-20
[Todalozyzok]("http://ubuntuforums.org/member.php?u=1577811") I could not read your reply. This is what I see:

[URL="http://ubuntuforums.org/member.php?u=1577811"]脦谩贸帽貌冒卯茅帽貌芒卯
脢卯矛茂脿铆猫每 脙猫盲冒卯-脙脌脨脌脥脪 莽脿铆猫矛脿氓貌帽每 茂冒卯猫莽芒卯盲帽貌芒卯矛 冒氓莽猫铆卯-貌氓玫铆猫梅氓帽锚猫玫 猫莽盲氓毛猫茅. 脗 帽茂氓锚貌冒 猫玫 茂冒卯盲贸锚枚猫猫 芒玫卯盲每貌: 茫猫盲冒卯酶茂卯铆锚猫, 茫氓冒铆猫貌卯芒没茅 酶铆贸冒 , 盲氓么卯冒矛脿枚猫卯铆铆没氓 酶芒没, 谩氓铆貌卯铆猫貌卯芒没茅 酶铆贸冒 , 酶铆贸冒没 猫莽 茫猫盲冒卯么猫毛眉铆卯茅 冒氓莽猫铆没, 谩氓铆貌卯铆猫貌卯芒没氓 矛脿貌没 , 茂冒卯么猫毛猫冒卯芒脿铆铆没氓 矛氓矛谩冒脿铆没 . 脻貌卯 毛猫酶眉 铆氓谩卯毛眉酶卯茅 茂氓冒氓梅氓铆眉 猫玫 茂冒卯盲贸锚枚猫猫. 脙猫盲冒卯酶茂卯铆锚猫 脙猫盲冒卯脢卯铆貌贸冒 帽氓茫卯盲铆每 每芒毛每镁貌帽每 毛猫盲氓冒卯矛 茂卯 枚氓铆氓 猫 锚脿梅氓帽貌芒贸 猫 茂卯毛眉莽贸镁貌帽每 卯茫冒卯矛铆没矛 帽茂冒卯帽卯矛 帽冒氓盲猫 帽貌冒卯猫貌氓毛眉铆没玫 卯冒茫脿铆猫莽脿枚猫茅. 脙氓冒铆猫貌卯芒没氓 酶铆贸冒没 芒没帽卯锚卯茫卯 锚脿梅氓帽貌芒脿 冒脿莽毛猫梅铆没玫 茂毛卯貌铆卯帽貌氓茅 酶猫冒卯锚卯 猫帽茂卯毛眉莽贸氓貌帽每 盲毛每 茫氓冒矛氓貌猫莽脿枚猫猫 矛氓忙茂脿铆氓毛眉铆没玫 酶芒卯芒 猫 盲氓么卯冒矛脿枚猫卯铆铆没玫 酶芒卯芒 莽盲脿铆猫每. 脕氓铆貌卯铆猫貌卯芒没氓 矛脿貌没 脨卯帽谩氓铆貌 每芒毛每镁貌帽每 脿铆脿毛卯茫卯矛 矛脿貌卯芒 Voltex , 矛铆卯茫卯 毛氓貌 茂冒猫矛氓铆每镁貌帽每 铆脿 冒没铆锚氓 冒脭, 猫帽茂卯毛眉莽卯芒脿毛猫帽眉 铆脿 帽卯貌铆每玫 莽铆脿梅猫矛没玫 卯谩煤氓貌卯芒 脨卯帽帽猫猫. 脪脿锚忙氓 锚卯矛茂脿铆猫每 脙猫盲冒卯-脙脌脨脌脥脪 芒没茂卯毛铆每氓貌 莽脿锚脿莽没 冒氓莽猫铆卯芒没玫 猫莽盲氓毛猫茅 猫 猫莽盲氓毛猫茅 猫莽 脧脗脮 茂卯 梅氓冒貌氓忙脿矛 莽脿锚脿莽梅猫锚脿. 脰氓铆没 芒帽氓茫盲脿 铆猫莽锚猫氓, 谩氓莽 铆脿锚冒贸貌卯锚 茂氓冒氓茂冒卯盲脿芒枚卯芒
[/URL]
Jim

---

